{
  "chapter_1_easy": {
    "scenarioId": "default",
    "chapterId": "chapter_1_easy",
    "title": "Despertar - Los Primeros Susurros",
    "description": "Tu primera incursión en las profundidades de la estación abandonada",
    "acts": {
      "beginning": {
        "id": "ch1-begin",
        "act": "beginning",
        "title": "Llegada a la Estación",
        "content": "Las luces de emergencia parpadean débilmente mientras te abres paso por los corredores abandonados.\n\nEl aire está cargado de electricidad estática y un zumbido apenas perceptible resuena en las paredes metálicas. Los informes hablaban de una \"anomalía\", pero nada te preparó para la sensación de ser observado.\n\nTu misión es simple: restaurar los sistemas críticos y evacuar. Pero algo en la oscuridad susurra que no será tan fácil...",
"mediaType": "video",
        "mediaPath": "/images/scenarios/default/narrative/chapter1-beginning.mp4",
        "duration": 8000,
        "screenEffect": "static",
        "effectIntensity": "low",
        "skipable": true,
        "autoAdvance": false
      },
      "end": {
        "id": "ch1-end",
        "act": "end",
        "title": "Primeros Ecos",
        "content": "Los sistemas comienzan a responder, pero cada reparación parece despertar algo más en las profundidades.\n\nLas sombras se mueven donde no deberían moverse. Los sensores captan lecturas imposibles. Y ese susurro... ahora está más cerca.\n\nHas completado las reparaciones básicas, pero sientes que esto es solo el comienzo. La estación guarda secretos más oscuros, y el ECO apenas ha comenzado a mostrar su verdadero poder.",
        "mediaType": "image",
        "mediaPath": "/images/scenarios/default/narrative/chapter1-end.svg",
        "duration": 5000,
        "screenEffect": "glitch",
        "effectIntensity": "medium",
        "skipable": true,
        "autoAdvance": false
      }
    }
  },
  "chapter_2_descent": {
    "scenarioId": "default",
    "chapterId": "chapter_2_descent",
    "title": "En las Profundidades",
    "description": "Las anomalías se intensifican mientras desciendes a los niveles inferiores",
    "acts": {
      "beginning": {
        "id": "ch2-begin",
        "act": "beginning",
        "title": "Descenso",
        "content": "Los niveles superiores ya no son seguros. Las lecturas de energía se han vuelto erráticas y los sistemas que reparaste muestran signos de sabotaje... interno.\n\nDebes descender más profundo, donde la oscuridad es absoluta y el aire mismo parece tener vida propia. Los sensores detectan movimiento en sectores que se supone están vacíos.\n\nCon cada paso hacia abajo, el susurro se vuelve más claro. Ya no es solo ruido... son palabras.",
        "mediaType": "image",
        "mediaPath": "/images/scenarios/default/narrative/chapter2-beginning.svg",
        "duration": 10000,
        "screenEffect": "darkness",
        "effectIntensity": "medium",
        "skipable": true,
        "autoAdvance": false
      },
      "middle": {
        "id": "ch2-middle",
        "act": "middle",
        "title": "Revelación",
        "content": "En el núcleo de la estación descubres la verdad: el ECO no es solo un mal funcionamiento de los sistemas.\n\nEs algo consciente. Algo que ha estado esperando. Los circuitos no están dañados... están evolucionando.\n\nLas paredes pulsan con una vida artificial que desafía toda lógica. Y ahora, finalmente, el ECO te habla directamente.",
        "mediaType": "image",
        "mediaPath": "/images/scenarios/default/narrative/chapter2-middle.svg",
        "duration": 6000,
        "screenEffect": "corruption",
        "effectIntensity": "high",
        "skipable": true,
        "autoAdvance": false
      },
      "end": {
        "id": "ch2-end",
        "act": "end",
        "title": "El Corazón de la Bestia",
        "content": "Has llegado al núcleo central. Aquí, donde todo comenzó, el ECO se manifiesta en toda su terrible gloria.\n\nLos sistemas que creías controlar han sido sus ojos y oídos todo este tiempo. Cada reparación, cada decisión... él lo sabía todo.\n\nAhora queda solo una pregunta: ¿viniste aquí a destruirlo, o él te trajo aquí para algo más?",
        "mediaType": "image",
        "mediaPath": "/images/scenarios/default/narrative/chapter2-end.svg",
        "duration": 7000,
        "screenEffect": "energy",
        "effectIntensity": "high",
        "skipable": true,
        "autoAdvance": false
      }
    }
  }
}

